#+TITLE:
#+AUTHOR:
#+EMAIL:
#+KEYWORDS:
#+DESCRIPTION:
#+TAGS:
#+LANGUAGE: en
#+OPTIONS: toc:nil ':t H:5
#+STARTUP: hidestars overview
#+LaTeX_CLASS: scrartcl
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+PANDOC_OPTIONS:

The goal is to enrich the DNB dataset and index it with Elastic.

** place

#+BEGIN_SRC sh
  ./json2json.py -n -p place DNBTitel.json.gz | sort -S1G | uniq -c > place.tsv
#+END_SRC

#+BEGIN_SRC sh
  head place.tsv
#+END_SRC

#+RESULTS:
| 5106754 |             |          |                    |      |
|       1 | ['010']     |          |                    |      |
|       1 | ['0rleans'] |          |                    |      |
|       1 | ['1']       |          |                    |      |
|       1 | ['1010      | Wien,    | Blutgasse          | 3']  |
|       1 | ['1010      | Wien,    | Schubertring       | 3']  |
|       3 | ['10179     | Berlin'] |                    |      |
|       1 | ['1037      | Wien,    | Daffingerstraße    | 1']  |
|       1 | ['1050      | Wien,    | Kettenbrückengasse | 3']  |
|       1 | ['1070      | Wien,    | Lindengasse        | 47'] |

** extract subclasses of writer
To label entities whose occupation property points to a subclass of
writer, we extract all subclasses of writer with SPARQL, since this is
faster and simpler than using the dump.

Since an entity can have several values for the occupation property
(e.g., [[https://www.wikidata.org/wiki/Q23][George Washington]]) we extract all values and if one of the
occupations is a subclass of writer, we label the entity as a writer.

We do this with curl as before:
#+BEGIN_SRC sparql :url https://query.wikidata.org/sparql :format text/csv
  SELECT ?subclass
  WHERE
  {
    ?subclass wdt:P279* wd:Q36180
  }
#+END_SRC

#+BEGIN_SRC sh :results silent
  curl \
      --header "Accept: text/tab-separated-values" \
      --output wikidata_writer_subclasses.tsv \
      --globoff \
       'https://query.wikidata.org/sparql?query=SELECT%20%3Fsubclass%20%3FsubclassLabel%0AWHERE%0A%7B%0A%20%20%3Fsubclass%20wdt%3AP279*%20wd%3AQ36180%20.%0A%20%20SERVICE%20wikibase%3Alabel%20%7B%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%23%20...%20include%20the%20labels%0A%20%20%20%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%0A%20%20%7D%0A%7D'
#+END_SRC


#+BEGIN_SRC sh
  wc -l wikidata_writer_subclasses.tsv
#+END_SRC

#+RESULTS:
: 279 wikidata_writer_subclasses.tsv

** DONE media types

All media:
#+BEGIN_SRC sh
  ./json2json.py -f -p type DNBTitel_normalised_enriched.json.gz \
      | sort -S1G | uniq -c > media_freq.tsv
#+END_SRC

With usable page numbers:
#+BEGIN_SRC sh :results silent
  ./json2json.py -f -p type,pages_norm \
		 DNBTitel_normalised_enriched.json.gz \
      | cut -f1 | sort -S1G | uniq -c > media_with_pages_freq.tsv
#+END_SRC

With all data filters except >= 1912:
#+BEGIN_SRC sh :results silent
  ./json2json.py -f -p "type,pages_norm,creator_wd.*.occupation_writer" \
		 DNBTitel_normalised_enriched.json.gz \
      | cut -f1 | sort -S1G | uniq -c > media_filtered_freq.tsv
#+END_SRC

With all data filters:
#+BEGIN_SRC sh :results silent
  ./json2json.py -f -p "issued_norm,type,pages_norm,creator_wd.*.occupation_writer" \
		 DNBTitel_normalised_enriched.json.gz \
      | awk -F'\t' '{if ($1 >= 1912) print $2}' \
      | sort -S1G | uniq -c > media_filtered_1912_freq.tsv
#+END_SRC

Combine into a table:
#+BEGIN_SRC sh
  cat media_freq.tsv
  echo "---"
  cat media_with_pages_freq.tsv
  echo "---"
  cat media_filtered_freq.tsv
  echo "---"
  cat media_filtered_1912_freq.tsv
#+END_SRC

| type       |     freq | freq (pages given) | freq (filtered) | freq (filtered, >= 1912) |
|------------+----------+--------------------+-----------------+--------------------------|
|            |    11070 |                    |                 |                          |
| Article    |   981677 |                    |                 |                          |
| Collection |   393390 |                347 |              39 |                        1 |
| Document   | 10632628 |            7434113 |         1047801 |                  1029608 |
| Issue      |  1470688 |            1036770 |                 |                          |
| Periodical |   489990 |                  8 |                 |                          |
| Series     |   122866 |                 20 |                 |                          |
|------------+----------+--------------------+-----------------+--------------------------|
| *sum*      | 14102309 |            8471258 |         1047840 |                  1029609 |
#+TBLFM: @9$2=vsum(@I..@II)::@9$3=vsum(@I..@II)::@9$4=vsum(@I..@II)::@9$5=vsum(@I..@II)

*** by item count
#+BEGIN_SRC sh
  ./json2json.py -f -p "issued_norm,pages_norm,creator_wd.*.occupation_writer,creator_wd.*.name,creator_wd.*.id" \
		 DNBTitel_normalised_enriched.json.gz \
      | awk -F'\t' '{if ($1 >= 1912) print "[[https://www.wikidata.org/wiki/"$5"]["$4"]]"}' \
      | sort -S1G | uniq -c | sort -nr | head -n20
#+END_SRC

| author                     | frequency |
|----------------------------+-----------|
| [[https://www.wikidata.org/wiki/Q5879][Johann Wolfgang von Goethe]] |      5079 |
| [[https://www.wikidata.org/wiki/Q78484][Rudolf Steiner]]             |      3963 |
| [[https://www.wikidata.org/wiki/Q25973][Hermann Hesse]]              |      3327 |
| [[https://www.wikidata.org/wiki/Q60753][Heinz G. Konsalik]]          |      3184 |
| [[https://www.wikidata.org/wiki/Q37030][Thomas Mann]]                |      2504 |
| [[https://www.wikidata.org/wiki/Q78491][Stefan Zweig]]               |      2481 |
| [[https://www.wikidata.org/wiki/Q905][Franz Kafka]]                |      2012 |
| [[https://www.wikidata.org/wiki/Q22670][Friedrich Schiller]]         |      2002 |
| [[https://www.wikidata.org/wiki/Q26993][Theodor Storm]]              |      1947 |
| [[https://www.wikidata.org/wiki/Q6701][Jacob Grimm]], [[https://www.wikidata.org/wiki/Q6714][Wilhelm Grimm]] |      1922 |
| [[https://www.wikidata.org/wiki/Q38757][Bertolt Brecht]]             |      1904 |
| [[https://www.wikidata.org/wiki/Q76546][Erich Kästner]]              |      1858 |
| [[https://www.wikidata.org/wiki/Q9358][Friedrich Nietzsche]]        |      1774 |
| [[https://www.wikidata.org/wiki/Q42747][Heinrich Böll]]              |      1769 |
| [[https://www.wikidata.org/wiki/Q692][William Shakespeare]]        |      1699 |
| [[https://www.wikidata.org/wiki/Q110382][Marie Louise Fischer]]       |      1676 |
| [[https://www.wikidata.org/wiki/Q76483][Rainer Maria Rilke]]         |      1655 |
| [[https://www.wikidata.org/wiki/Q122370][Gottfried Keller]]           |      1652 |
| [[https://www.wikidata.org/wiki/Q9554][Martin Luther]]              |      1597 |
| [[https://www.wikidata.org/wiki/Q45330][Anselm Grün]]                |      1552 |

One restriction here is that we do not count works with more than one
author for the individual authors. For instance, Jacob Grimm and
Wilhelm Grimm appear only as a pair, although, individually, they
would score higher if the works they co-authored were split up:

#+BEGIN_SRC sh
  grep "Jacob Grimm" author_pages_stats.tsv
#+END_SRC

| author                                                          |  pages | items | mean pages |
|-----------------------------------------------------------------+--------+-------+------------|
| *Jacob Grimm*, Wilhelm Grimm                                    | 247233 |  1922 |        128 |
| *Jacob Grimm*                                                   |  14650 |    89 |        164 |
| Ludwig Bechstein, *Jacob Grimm*, Wilhelm Grimm                  |   1043 |     9 |        115 |
| Bettina von Arnim, *Jacob Grimm*, Wilhelm Grimm                 |    418 |     1 |        418 |
| Walt Disney, *Jacob Grimm*                                      |     29 |     1 |         29 |
| Jernej Kopitar, *Jacob Grimm*                                   |    217 |     1 |        217 |
| Karl Hartwig Gregor von Meusebach, *Jacob Grimm*, Wilhelm Grimm |    426 |     1 |        426 |
| Johann Andreas Christian Löhr, *Jacob Grimm*, Wilhelm Grimm     |    128 |     1 |        128 |
|-----------------------------------------------------------------+--------+-------+------------|
| *sum*                                                           | 264144 |  2025 |        130 |
#+TBLFM: @10$2=vsum(@I..@II)::@10$3=vsum(@I..@II)::@10$4=$-2/$-1;%2.0f

#+BEGIN_SRC sh
  grep "Wilhelm Grimm" author_pages_stats.tsv
#+END_SRC

| author                                                          |  pages | items | mean pages |
|-----------------------------------------------------------------+--------+-------+------------|
| Jacob Grimm, *Wilhelm Grimm*                                    | 247233 |  1922 |        128 |
| *Wilhelm Grimm*                                                 |   2598 |    13 |        199 |
| Bettina von Arnim, Jacob Grimm, *Wilhelm Grimm*                 |    418 |     1 |        418 |
| Ludwig Bechstein, Jacob Grimm, *Wilhelm Grimm*                  |   1043 |     9 |        115 |
| Karl Hartwig Gregor von Meusebach, Jacob Grimm, *Wilhelm Grimm* |    426 |     1 |        426 |
| Johann Andreas Christian Löhr, Jacob Grimm, *Wilhelm Grimm*     |    128 |     1 |        128 |
|-----------------------------------------------------------------+--------+-------+------------|
| *sum*                                                           | 251846 |  1947 |        129 |
#+TBLFM: @8$2=vsum(@I..@II)::@8$3=vsum(@I..@II)::@8$4=$-2/$-1;%2.0f

